{
  "isbn_9781952457012": {
    "data": {
      "google_books_id": "SpXZDwAAQBAJ",
      "title": "From Blood and Ash",
      "authors": [
        "Jennifer L. Armentrout"
      ],
      "publisher": "Blue Box Press",
      "isbn_10": "1952457017",
      "isbn_13": "9781952457012",
      "release_date": "2020-03-30",
      "page_count": 345,
      "categories": [
        "Fiction"
      ],
      "description": "Captivating and action-packed, From Blood and Ash is a sexy, addictive, and unexpected fantasy perfect for fans of Sarah J. Maas and Laura Thalassa. A Maiden… Chosen from birth to usher in a new era, Poppy’s life has never been her own. The life of the Maiden is solitary. Never to be touched. Never to be looked upon. Never to be spoken to. Never to experience pleasure. Waiting for the day of her Ascension, she would rather be with the guards, fighting back the evil that took her family, than preparing to be found worthy by the gods. But the choice has never been hers. A Duty… The entire kingdom’s future rests on Poppy’s shoulders, something she’s not even quite sure she wants for herself. Because a Maiden has a heart. And a soul. And longing. And when Hawke, a golden-eyed guard honor bound to ensure her Ascension, enters her life, destiny and duty become tangled with desire and need. He incites her anger, makes her question everything she believes in, and tempts her with the forbidden. A Kingdom… Forsaken by the gods and feared by mortals, a fallen kingdom is rising once more, determined to take back what they believe is theirs through violence and vengeance. And as the shadow of those cursed draws closer, the line between what is forbidden and what is right becomes blurred. Poppy is not only on the verge of losing her heart and being found unworthy by the gods, but also her life when every blood-soaked thread that holds her world together begins to unravel. Reviews for From Blood and Ash: \"Dreamy, twisty, steamy escapism. Take me back!\" -New York Times bestseller Wendy Higgins “Jennifer Armentrout has the power to control my emotions with every word she writes. From swooning to crying to racing through the pages to find out what happens next, I couldn't stop reading about Hawke and Poppy, and you won't be able to either.” - Brigid Kemmerer, New York Times Bestselling Author of A Curse So Dark and Lonely “Action, adventure, sexiness, and angst! From Blood and Ash has it all and double that. So many feels and so many moments it made me cheer for the character. Read. This. Book! You'll be obsessed!” - Tijan NYT bestselling author “From Blood and Ash is a phenomenal fantasy novel that is filled to the brim with danger, mystery and heart melting romance. I loved every single second of it and I couldn’t get enough of this new fantastical world. A heart stopping start to what is clearly going to be a stunning series, perfect for both those who love fantasy and those who are new to the genre. A must read.” Kayleigh, K-Books \"If you think you are ready for From Blood and Ash, think again. Jennifer L. Armentrout has woven a new fantasy universe that will leave you reeling. Filled with action, heart wrenching twists and the most delicious romance, this unputdownable novel comes with a warning: keep a fan close by, because the temperatures are about to rise.\" Elena, The Bibliotheque Blo “In this exciting new novel by Jennifer L. Armentrout, she introduces a fantastical world filled with immense detail, and characters who are poignant and fierce, Jennifer truly has out done herself!” – BookBesties “From Blood and Ash is a fantastic fantasy that will hook you immediately from the very first page! I loved every single moment and all of the characters are ones you will fall in love with! Jennifer L. Armentrout has done it again with her amazing writing skills and lots of detail! Get this book immediately!!!” - Amanda @Stuck In YA Books “Jennifer has stepped into the fantasy genre with this absolutely amazing novel. With characters you will love and more than a few twists and turns, get ready for one amazing adventure.” -Perpetual Fangirl \"This magnificent book has so many pieces in it: fantasy, mystery, forbidden romance, supernatural, lies, deceit, betrayal, love, friendship, family. And so, so, so many secrets your head will be spinning. Jennifer L. Armentrout has created another masterpiece that I will be rushing to buy, and will be telling everyone to read it ASAP!\" ~Jeraca @My Nose in YA Books “From Blood to Ash is the first high fantasy book from Jennifer L Armentrout, but hopefully not the last. Like all her other works, her ability to create worlds, create swoon worthy men, and feisty strong female characters is amazing. Fantasy, mystery, romance, betrayal, love, and steamy scenes, this book has it all.” - Lisa @ The Blonde Book Lover “From Blood & Ash is everything we love about JLA’s fantasy writing...pumped up on steroids. There’s epic world building and plot twists, a strong female lead, a swoon worthy book hottie, a steamy forbidden love story, and side characters that can’t help but steal your heart. My mind was blown by the end of this book.” - Kris S. (frantic4romantic) “Step into an exciting new fantasy world by Jennifer L. Armentrout, From Blood And Ash takes you on a fantastic ride with twists and turns galore. Characters you will love to laugh and cry with. A phenomenal start to an exciting new series.” - Lori Dunn an avid reader “From Blood and Ash was everything I wanted in a high fantasy novel. The myths, the legends, the epic romance, and an adventure that will keep you on your toes beginning to end. I couldn’t put the book down. Truly a brilliant start to what I believe will be yet another amazing series by Jennifer L. Armentrout.\" –Sabrina, Books Are My Life “Jennifer L. Armentrout takes her first step into the high fantasy genre with From Blood and Ash. A story of forbidden love, lies, secrets, and betrayal - it will leave you wanting more after the very last page.” - Love Just Is Books “From Blood and Ash is like reading my favorite book for first time.” - Raquel Herrera “With From Blood and Ash, Jennifer Armentrout successfully takes on the genre of high fantasy, proving, once again, that she is a master of her craft. Filled with epic adventure, forbidden romance, deceit, lies, and betrayal, FB&A draws you in from page one and refuses to let go!” - Erica, The Rest Just Falls Away “Jennifer L. Armentrout comes trough once again with From Blood and Ash as it kept me enthralled throughout the full book. You won't be able to put down this epic story once you start.” - Julalicious Book Paradise “From Blood and Ash strikes the perfect balance between fantasy and romance elements leaving the world feeling live in and full while allowing the relationship between the main characters feeling real and authentic.” - Nads Book Nook, Nadine Bergeron “Be prepared to spend your whole day reading From Blood and Ash. Once you start reading this high fantasy novel, you won't want to put it down.” - Love Book Triangle “From Blood and Ash is absolutely breath taking. JLA does what she does best by creating a fantastical world filled with romance, lies, betrayal, adventure and all things we love and expect from JLA characters that melt our hearts and steal our hearts and souls. I cannot wait for the next one!” - Pia Colon “From Blood and Ash, Jennifer L. Armentrout brought to life a high fantasy that is enthralling. Another masterful addition to my collection. Get ready to stay on your toes from start to end.” - Amy Oh, Reader by the Mountains “From Blood and Ash is the first high fantasy novel by Jennifer L Armentrout and she absolutely nails it. This is fantasy for skeptics and unbelievers because it makes you want to be a fantasy fan! This page turner makes you want to devour it in one night and at the same time savor every detail. Heart stopping and inspiring and grips you from page one.” – Tracy Kirby “An intriguing puzzle of a world, a ruthless hero, a determine heroin, and a plot that will keep you up late, this book is one of the best I've read this year.” – Valerie from Stuck In Books “From Blood and Ash, a thrilling high fantasy that packs a punch, each page will leave you wanting more!” - Tracey, Books & Other Pursuits",
      "cover_url": "http://books.google.com/books/content?id=SpXZDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "price": 8.99,
      "format": "book",
      "source": "google_books",
      "series_name": null,
      "series_position": null
    },
    "cached_at": "2025-07-23T01:48:18.660138"
  },
  "isbn_9780765326355": {
    "data": {
      "google_books_id": "kIjwwAEACAAJ",
      "title": "The Way of Kings",
      "authors": [
        "Brandon Sanderson"
      ],
      "publisher": "Tor Books",
      "isbn_10": "0765326353",
      "isbn_13": "9780765326355",
      "release_date": "2010-08-31",
      "page_count": 1008,
      "categories": [
        "Fiction"
      ],
      "description": "From #1 New York Times bestselling author Brandon Sanderson, The Way of Kings, Book One of the Stormlight Archive begins an incredible new saga of epic proportion. Roshar is a world of stone and storms. Uncanny tempests of incredible power sweep across the rocky terrain so frequently that they have shaped ecology and civilization alike. Animals hide in shells, trees pull in branches, and grass retracts into the soilless ground. Cities are built only where the topography offers shelter. It has been centuries since the fall of the ten consecrated orders known as the Knights Radiant, but their Shardblades and Shardplate remain: mystical swords and suits of armor that transform ordinary men into near-invincible warriors. Men trade kingdoms for Shardblades. Wars were fought for them, and won by them. One such war rages on a ruined landscape called the Shattered Plains. There, Kaladin, who traded his medical apprenticeship for a spear to protect his little brother, has been reduced to slavery. In a war that makes no sense, where ten armies fight separately against a single foe, he struggles to save his men and to fathom the leaders who consider them expendable. Brightlord Dalinar Kholin commands one of those other armies. Like his brother, the late king, he is fascinated by an ancient text called The Way of Kings. Troubled by over-powering visions of ancient times and the Knights Radiant, he has begun to doubt his own sanity. Across the ocean, an untried young woman named Shallan seeks to train under an eminent scholar and notorious heretic, Dalinar's niece, Jasnah. Though she genuinely loves learning, Shallan's motives are less than pure. As she plans a daring theft, her research for Jasnah hints at secrets of the Knights Radiant and the true cause of the war. The result of over ten years of planning, writing, and world-building, The Way of Kings is but the opening movement of the Stormlight Archive, a bold masterpiece in the making. Speak again the ancient oaths: Life before death. Strength before weakness. Journey before Destination. and return to men the Shards they once bore. The Knights Radiant must stand again. Other Tor books by Brandon Sanderson The Cosmere The Stormlight Archive The Way of Kings Words of Radiance Edgedancer (Novella) Oathbringer (forthcoming) The Mistborn trilogy Mistborn: The Final Empire The Well of Ascension The Hero of Ages Mistborn: The Wax and Wayne series Alloy of Law Shadows of Self Bands of Mourning Collection Arcanum Unbounded Other Cosmere novels Elantris Warbreaker The Alcatraz vs. the Evil Librarians series Alcatraz vs. the Evil Librarians The Scrivener's Bones The Knights of Crystallia The Shattered Lens The Dark Talent The Rithmatist series The Rithmatist Other books by Brandon Sanderson The Reckoners Steelheart Firefight Calamity",
      "cover_url": "http://books.google.com/books/content?id=kIjwwAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "price": null,
      "format": "book",
      "source": "google_books",
      "series_name": null,
      "series_position": null
    },
    "cached_at": "2025-07-27T14:01:12.941925"
  },
  "title_the fellowship of the ring": {
    "data": [
      {
        "google_books_id": "7iS1CCpHrJgC",
        "title": "The Fellowship of the Ring",
        "authors": [
          "J.R.R. Tolkien"
        ],
        "publisher": "Del Rey",
        "isbn_10": "0345339703",
        "isbn_13": "9780345339706",
        "release_date": "1988-01-01",
        "page_count": 532,
        "categories": [
          "Fiction"
        ],
        "description": "The opening novel of The Lord of the Rings—the greatest fantasy epic of all time—which continues in The Two Towers and The Return of the King. Nominated as one of America’s best-loved novels by PBS’s The Great American Read The dark, fearsome Ringwraiths are searching for a Hobbit. Frodo Baggins knows that they are seeking him and the Ring he bears—the Ring of Power that will enable evil Sauron to destroy all that is good in Middle-earth. Now it is up to Frodo and his faithful servant, Sam, with a small band of companions, to carry the Ring to the one place it can be destroyed: Mount Doom, in the very center of Sauron’s realm.",
        "cover_url": "http://books.google.com/books/content?id=7iS1CCpHrJgC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "xFr92V2k3PIC",
        "title": "The Fellowship of the Ring (The Lord of the Rings, Book 1)",
        "authors": [
          "J. R. R. Tolkien"
        ],
        "publisher": "HarperCollins UK",
        "isbn_10": "0007322496",
        "isbn_13": "9780007322497",
        "release_date": "2009-04-20",
        "page_count": 442,
        "categories": [
          "Fiction"
        ],
        "description": "Darkness Will Bind Them... watch The Lord of the Rings: The Rings of Power season 2 on Prime Video",
        "cover_url": "http://books.google.com/books/content?id=xFr92V2k3PIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "bm2cPwAACAAJ",
        "title": "The Fellowship of the Ring",
        "authors": [
          "J. R. R. Tolkien"
        ],
        "publisher": "Harpercollins Pub Limited",
        "isbn_10": "0007203543",
        "isbn_13": "9780007203543",
        "release_date": "2005-01-01",
        "page_count": 432,
        "categories": [
          "Fiction"
        ],
        "description": "Wayne G. Hammond and Christina Scull examine Tolkien's masterpiece chapter by chapter, offering expert insights into its evolution, structure, and meaning. They discuss in close detail important literary and historical influences on the development of The Lord of the Rings, connections between that work and other writings by Tolkien, errors and inconsistencies, significant changes to the text during its fifty years of publication, archaic and unusual words used by Tolkien, and words and passages in his invented languages of Middle-earth.",
        "cover_url": "http://books.google.com/books/content?id=bm2cPwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "QwxEwAEACAAJ",
        "title": "The Fellowship of the Ring",
        "authors": [
          "John Ronald Reuel Tolkien"
        ],
        "publisher": null,
        "isbn_10": "0618153985",
        "isbn_13": "9780618153985",
        "release_date": "1965-01-01",
        "page_count": 423,
        "categories": [
          "British and Irish fiction (Fictional works by one author)."
        ],
        "description": "The first book in the Lord of the Rings, series.",
        "cover_url": null,
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "FKziXsnqLTEC",
        "title": "The Lord of the Rings: The Fellowship of the Ring, The Two Towers, The Return of the King",
        "authors": [
          "J. R. R. Tolkien"
        ],
        "publisher": "HarperCollins UK",
        "isbn_10": "0007322593",
        "isbn_13": "9780007322596",
        "release_date": "2009-04-20",
        "page_count": 1229,
        "categories": [
          "Fiction"
        ],
        "description": "Darkness Will Bind Them... watch The Lord of the Rings: The Rings of Power season 2 on Prime Video",
        "cover_url": "http://books.google.com/books/content?id=FKziXsnqLTEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "2R_9swEACAAJ",
        "title": "The Fellowship of the Ring",
        "authors": [
          "John Ronald Reuel Tolkien"
        ],
        "publisher": null,
        "isbn_10": "0786251786",
        "isbn_13": "9780786251780",
        "release_date": "2003-01-01",
        "page_count": 855,
        "categories": [
          "Fiction"
        ],
        "description": "Young Frodo Baggins is faced with an immense task as his elderly cousin Bilbo entrusts the One Ring of Sauron to his care.",
        "cover_url": "http://books.google.com/books/content?id=2R_9swEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "Zw24wCYcF1EC",
        "title": "The Fellowship of the Ring",
        "authors": [
          "John Ronald Reuel Tolkien"
        ],
        "publisher": null,
        "isbn_10": "0007123825",
        "isbn_13": "9780007123827",
        "release_date": "2001-01-01",
        "page_count": 580,
        "categories": [
          "Fiction"
        ],
        "description": "The first book in the Lord of the rings trilogy.",
        "cover_url": "http://books.google.com/books/content?id=Zw24wCYcF1EC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "UY9LPgAACAAJ",
        "title": "Fellowship of the Ring",
        "authors": [
          "J. R. R. Tolkien"
        ],
        "publisher": "Lord of the Rings",
        "isbn_10": "0812415582",
        "isbn_13": "9780812415582",
        "release_date": "1986-08-01",
        "page_count": 0,
        "categories": [
          "Fiction"
        ],
        "description": "Lord of the Rings Trilogy #1.",
        "cover_url": "http://books.google.com/books/content?id=UY9LPgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "Uo5FzwEACAAJ",
        "title": "The Lord of the Rings",
        "authors": [
          "J. R. R. Tolkien"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1965-01-01",
        "page_count": 0,
        "categories": [],
        "description": null,
        "cover_url": null,
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "fWmIvgEACAAJ",
        "title": "The Fellowship of the Ring (Blu-Ray).",
        "authors": [
          "John Ronald Reuel Tolkien"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2010-01-01",
        "page_count": null,
        "categories": [],
        "description": null,
        "cover_url": null,
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL27513W",
        "title": "The Fellowship of the Ring",
        "authors": [
          "J.R.R. Tolkien"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1954-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/14627060-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL43075750W",
        "title": "The Fellowship of the Ring",
        "authors": [
          "J.R.R. Tolkien"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1965-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL27496W",
        "title": "Novels (Fellowship of the Ring / Hobbit)",
        "authors": [
          "J.R.R. Tolkien"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1954-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/1885351-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL39176899W",
        "title": "Fellowship of the Ring",
        "authors": [
          "J.R.R. Tolkien"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1993-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL8238812W",
        "title": "The Fellowship of the Ring",
        "authors": [
          "Howard Shore"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2002-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/505156-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL5758736W",
        "title": "The Art of The Fellowship of the Ring",
        "authors": [
          "Gary Russell"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2002-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/393768-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL29826386W",
        "title": "Fellowship of the Ring",
        "authors": [
          "Ptil S. J. Thliza"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2018-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL40229221W",
        "title": "Fellowship of the Ring",
        "authors": [
          "Expert Book Reviews"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2014-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL35352721W",
        "title": "The Fellowship of the Ring",
        "authors": [],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": null,
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL43091128W",
        "title": "The Fellowship of the ring ",
        "authors": [
          "J.R.R. Tolkien"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1965-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/14921825-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      }
    ],
    "cached_at": "2025-07-27T14:04:24.484282"
  },
  "title_test manual book": {
    "data": [
      {
        "google_books_id": "HkeczwEACAAJ",
        "title": "Getting Ready to Test - a Review and Preparation Manual for Drug and Alcohol Credentialing Exams: a Review/Preparation Manual for Drug and Alcohol Credentialing Examinations; 9th Edition",
        "authors": [
          "Kevin Scheel"
        ],
        "publisher": null,
        "isbn_10": "0990838455",
        "isbn_13": "9780990838456",
        "release_date": "2023-02-01",
        "page_count": 0,
        "categories": [],
        "description": null,
        "cover_url": null,
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "1Pf2ygEACAAJ",
        "title": "Alabama Drivers Practice Handbook",
        "authors": [
          "Learner Learner Editions"
        ],
        "publisher": null,
        "isbn_10": "1697736513",
        "isbn_13": "9781697736519",
        "release_date": "2019-10-05",
        "page_count": 93,
        "categories": [],
        "description": "This book contains more than 300 questions and answers according to the new written DMV permit test. To pass the test, you must obtain (number out of number) correct answers. A correct answer can include several elements of an answer. These tests are intended to verify that you know the rules and that you know how to implement them. Some questions from the new exam appeal to behavior, situations, and your ability to use common sense. This book offers many questions with solutions. For the correct answers and explanations, please refer to the DMV Manual.",
        "cover_url": "http://books.google.com/books/content?id=1Pf2ygEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "zl8PDQAAQBAJ",
        "title": "Comprehending Test Manuals",
        "authors": [
          "Ann Silverlake"
        ],
        "publisher": "Routledge",
        "isbn_10": "1351970860",
        "isbn_13": "9781351970860",
        "release_date": "2016-09-13",
        "page_count": 159,
        "categories": [
          "Psychology"
        ],
        "description": "• Your students will get valuable practice in interpreting actual excerpts from published test manuals. • Each of the 39 exercises begins with a guideline that helps students review the measurement concepts they will need in order to complete the exercise. • Background notes on each exercise describe the purpose of the test from which the excerpt was drawn. • Students answer questions that require them to locate and interpret important points in the excerpt. • The excerpts are largely unabridged so that students practice interpreting material as it is actually presented by test makers. • The skills they learn with this book can be easily transferred to other test manuals they may be using in the future. • Students have an ethical responsibility to be thoroughly familiar with the technical characteristics of the tests they will use. This book prepares them for this responsibility. • All major topics are covered, including: · validity · reliability · standard error of measurement · norm group composition · derived scores · scales to detect faking · item analysis · cultural bias • The excerpts are drawn from tests such as: · Wechsler Intelligence Scale for Children · Peabody Picture Vocabulary Test · 16PF · Stanford Binet Intelligence Scale · MMPI · Beck Depression Inventory · Stanford Achievement Test Series · KeyMath · and many others!",
        "cover_url": "http://books.google.com/books/content?id=zl8PDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": 39.49,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "Lf1pzgEACAAJ",
        "title": "Georgia DMV Test Manual",
        "authors": [
          "Jeromy Pancake"
        ],
        "publisher": "Independently Published",
        "isbn_10": null,
        "isbn_13": "9798728321309",
        "release_date": "2021-03-25",
        "page_count": 96,
        "categories": [],
        "description": "Anyone who operates a motor vehicle or motorcycle on public roadways in Georgia is required to have a driver's license. When you apply for a Georgia DDS driver's license or instruction permit as required, you will be given a test consisting of several parts, with all of them being compulsory. You will be required to answer questions about traffic laws and to identify certain signs by their shape, color, or the symbol appearing on them. Don't worry because this Georgia DMV Test Manual Book can help you pass the test easily! This Georgia DMV Test Manual Book contains random multiple-choice CA permit tests with questions from the manual to help you get well prepared. As you are taking these practice exams, correct answers have been provided so that you know when you choose the wrong answer and correct yourself immediately and it will help you know how well you are doing during the test and be able to evaluate yourself. In this Georgia DMV Test Manual Book, we have 5 practical tests and each test consists of 65,54,50,135 and 46 respectively. In order to do well and become successful in this test, I would advise you to repeat each practical question until you get a consistent score above average, at least 87%. The practical questions contain over 250 questions and are a good way for preparing for an actual written test and come out successful. Also contained in this book are questions ranging from Drivers Road signs, permit practice test and each of these tests are like the actual written exams. It is a lot easier to prepare for your driving written exam using this Georgia DMV Test Manual Book instead of reading DMV driving handbook which can be time-consuming. You will also learn basic driving skills and how to read trick road signs and traffic signals with their meaning.",
        "cover_url": "http://books.google.com/books/content?id=Lf1pzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "fGvVygEACAAJ",
        "title": "Utah Drivers Practice Handbook",
        "authors": [
          "Learner Learner Editions"
        ],
        "publisher": null,
        "isbn_10": "1697944086",
        "isbn_13": "9781697944082",
        "release_date": "2019-10-06",
        "page_count": 93,
        "categories": [],
        "description": "This book contains more than 300 questions and answers according to the new written DMV permit test. To pass the test, you must obtain (number out of number) correct answers. A correct answer can include several elements of an answer. These tests are intended to verify that you know the rules and that you know how to implement them. Some questions from the new exam appeal to behavior, situations, and your ability to use common sense. This book offers many questions with solutions. For the correct answers and explanations, please refer to the DMV Manual.",
        "cover_url": "http://books.google.com/books/content?id=fGvVygEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "5wNezQEACAAJ",
        "title": "New York DMV Permit Practice Test Manual",
        "authors": [
          "Diana S Hill"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": "9798608931819",
        "release_date": "2020-02-04",
        "page_count": 108,
        "categories": [],
        "description": "This manual will give you every necessary help you will ever need to pass the DMV written exam irrespective of the part of the States you live in! Nonetheless, without any exaggerations, I'm supper certain that if you can give a little time to studying this manual, it would no doubt serve as a springboard towards ensuring your success; that you pass your DMV without tears. Taking these practice permit tests will help you to get acquainted with the real test and ensure the translation of your anticipated success in the exams to reality. In recent times, DMV tests have become somewhat quite complicated but with this manual, there is really no need to be afraid as the questions contained in it are close enough to what you will see and be tested on in the real test and in some cases, the questions herein are the same with the ones in the real test. The questions in this test manual covers different sections of what you need to know as a good driver and also be tested on, based on experience. And there are many questions and answers in it, which will give you an in-depth knowledge as well as sufficient preparation for the real test. The questions cut across; defensive driving, road signs/markings and turnings. It also include questions on braking, skid controls, steering techniques, and much more. As a matter of necessity, you are strongly encouraged to do well to repeat each test contained herein until you can achieve a consistent score of about 90% or more. In this manual you will learn the exact things that those who pass the test on their first attempt always do; that is, getting acquainted with the following: General Driving knowledge testDefensive driving testSkid controlTeen drivers testTest on road signs and traffic control seen on the highway, streets and walkway, Please, kindly check the back pages for the correct answers to the test questions contained in this the manua",
        "cover_url": "http://books.google.com/books/content?id=5wNezQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "BGlbzQEACAAJ",
        "title": "Texas DMV Permit Practice Test Manual",
        "authors": [
          "Diana S Hill"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": "9798608911378",
        "release_date": "2020-02-03",
        "page_count": 108,
        "categories": [],
        "description": "This manual will give you every necessary help you will ever need to pass the DMV written exam irrespective of the part of the States you live in! Nonetheless, without any exaggerations, I'm supper certain that if you can give a little time to studying this manual, it would no doubt serve as a springboard towards ensuring your success; that you pass your DMV without tears. Taking these practice permit tests will help you to get acquainted with the real test and ensure the translation of your anticipated success in the exams to reality. In recent times, DMV tests have become somewhat quite complicated but with this manual, there is really no need to be afraid as the questions contained in it are close enough to what you will see and be tested on in the real test and in some cases, the questions herein are the same with the ones in the real test. The questions in this test manual covers different sections of what you need to know as a good driver and also be tested on, based on experience. And there are many questions and answers in it, which will give you an in-depth knowledge as well as sufficient preparation for the real test. The questions cut across; defensive driving, road signs/markings and turnings. It also include questions on braking, skid controls, steering techniques, and much more. As a matter of necessity, you are strongly encouraged to do well to repeat each test contained herein until you can achieve a consistent score of about 90% or more. In this manual you will learn the exact things that those who pass the test on their first attempt always do; that is, getting acquainted with the following: General Driving knowledge testDefensive driving testSkid controlTeen drivers testTest on road signs and traffic control seen on the highway, streets and walkway, Please, kindly check the back pages for the correct answers to the test questions contained in this the manua",
        "cover_url": "http://books.google.com/books/content?id=BGlbzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "6oK-ygEACAAJ",
        "title": "OKLAHOMA Drivers Practice Handbook",
        "authors": [
          "Learner Learner Editions"
        ],
        "publisher": "Independently Published",
        "isbn_10": "1697521835",
        "isbn_13": "9781697521832",
        "release_date": "2019-10-04",
        "page_count": 93,
        "categories": [],
        "description": "This book contains more than 300 questions and answers according to the new written DMV permit test. To pass the test, you must obtain (number out of number) correct answers. A correct answer can include several elements of an answer. These tests are intended to verify that you know the rules and that you know how to implement them. Some questions from the new exam appeal to behavior, situations, and your ability to use common sense. This book offers many questions with solutions. For the correct answers and explanations, please refer to the DMV Manual.",
        "cover_url": "http://books.google.com/books/content?id=6oK-ygEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "OBGOygEACAAJ",
        "title": "Virginia Drivers Practice Handbook",
        "authors": [
          "Learner Learner Editions"
        ],
        "publisher": "Independently Published",
        "isbn_10": "1697724299",
        "isbn_13": "9781697724295",
        "release_date": "2019-10-05",
        "page_count": 93,
        "categories": [],
        "description": "This book contains more than 300 questions and answers according to the new written DMV permit test. To pass the test, you must obtain (number out of number) correct answers. A correct answer can include several elements of an answer. These tests are intended to verify that you know the rules and that you know how to implement them. Some questions from the new exam appeal to behavior, situations, and your ability to use common sense. This book offers many questions with solutions. For the correct answers and explanations, please refer to the DMV Manual.",
        "cover_url": "http://books.google.com/books/content?id=OBGOygEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "78NgzQEACAAJ",
        "title": "California DMV Permit Practice Test Manual",
        "authors": [
          "Diana S Hill"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": "9798608918902",
        "release_date": "2020-02-04",
        "page_count": 108,
        "categories": [],
        "description": "This manual will give you every necessary help you will ever need to pass the DMV written exam irrespective of the part of the States you live in! Nonetheless, without any exaggerations, I'm supper certain that if you can give a little time to studying this manual, it would no doubt serve as a springboard towards ensuring your success; that you pass your DMV without tears. Taking these practice permit tests will help you to get acquainted with the real test and ensure the translation of your anticipated success in the exams to reality. In recent times, DMV tests have become somewhat quite complicated but with this manual, there is really no need to be afraid as the questions contained in it are close enough to what you will see and be tested on in the real test and in some cases, the questions herein are the same with the ones in the real test. The questions in this test manual covers different sections of what you need to know as a good driver and also be tested on, based on experience. And there are many questions and answers in it, which will give you an in-depth knowledge as well as sufficient preparation for the real test. The questions cut across; defensive driving, road signs/markings and turnings. It also include questions on braking, skid controls, steering techniques, and much more. As a matter of necessity, you are strongly encouraged to do well to repeat each test contained herein until you can achieve a consistent score of about 90% or more. In this manual you will learn the exact things that those who pass the test on their first attempt always do; that is, getting acquainted with the following: General Driving knowledge testDefensive driving testSkid controlTeen drivers testTest on road signs and traffic control seen on the highway, streets and walkway, Please, kindly check the back pages for the correct answers to the test questions contained in this the manua",
        "cover_url": "http://books.google.com/books/content?id=78NgzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL35900550W",
        "title": "Tennessee Drivers Manual Book : 360 Practical Test Questions for Tennessee DMV Practice Test",
        "authors": [
          "Claud Pickenpaugh"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2021-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": "Tennessee Drivers Manual Book",
        "series_position": 360
      },
      {
        "openlibrary_id": "/works/OL17867410W",
        "title": "Test Book Title Manual Insert",
        "authors": [],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2018-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/9578951-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL17867411W",
        "title": "Test Book Title Manual Insert",
        "authors": [],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2018-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/9747810-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL9302820W",
        "title": "Cultural anthropology, instructor's manual and test book",
        "authors": [
          "Sanford J Siegel"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1976-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL24477276W",
        "title": "Electricians' Operating And Testing Manual; A Hand Book For Men In Charge Of Electrical Apparatus, Repair Men, Trouble Men, Lamp Trimmers, And Electricians Generally",
        "authors": [
          "Horstmann Henry Charles",
          "Victor H. Tousley"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2018-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/11088181-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL35370527W",
        "title": "Delmar's Manual of Laboratory and Diagnostic Tests (Book Only)",
        "authors": [
          "Rick Daniels"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2009-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL2647555W",
        "title": "ACSM's Resource Manual for Guidelines for Exercise Testing and Prescription (Books)",
        "authors": [
          "American College of Sports Medicine."
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2001-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/2624293-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL10300270W",
        "title": "Test of Language Development Primary Told-2 (Test Kit, Manual, Picture Book, and 50 Answer Sheets)",
        "authors": [
          "D. Hammill"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1987-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL13124336W",
        "title": "Manual of mental and physical tests: a book of directions compiled with ..",
        "authors": [
          "Guy Montrose Whipple"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1915-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/6034155-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL34311591W",
        "title": "CDL Test Study Guide 2015-2016 : Test Preparation Book & Manual for the Commercial Drivers License  Exam & All Endorsements",
        "authors": [
          "Test Prep Books"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2015-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/13195780-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      }
    ],
    "cached_at": "2025-07-27T14:04:44.435236"
  },
  "title_from blood and ash": {
    "data": [
      {
        "google_books_id": "SpXZDwAAQBAJ",
        "title": "From Blood and Ash",
        "authors": [
          "Jennifer L. Armentrout"
        ],
        "publisher": "Blue Box Press",
        "isbn_10": "1952457017",
        "isbn_13": "9781952457012",
        "release_date": "2020-03-30",
        "page_count": 345,
        "categories": [
          "Fiction"
        ],
        "description": "Captivating and action-packed, From Blood and Ash is a sexy, addictive, and unexpected fantasy perfect for fans of Sarah J. Maas and Laura Thalassa. A Maiden… Chosen from birth to usher in a new era, Poppy’s life has never been her own. The life of the Maiden is solitary. Never to be touched. Never to be looked upon. Never to be spoken to. Never to experience pleasure. Waiting for the day of her Ascension, she would rather be with the guards, fighting back the evil that took her family, than preparing to be found worthy by the gods. But the choice has never been hers. A Duty… The entire kingdom’s future rests on Poppy’s shoulders, something she’s not even quite sure she wants for herself. Because a Maiden has a heart. And a soul. And longing. And when Hawke, a golden-eyed guard honor bound to ensure her Ascension, enters her life, destiny and duty become tangled with desire and need. He incites her anger, makes her question everything she believes in, and tempts her with the forbidden. A Kingdom… Forsaken by the gods and feared by mortals, a fallen kingdom is rising once more, determined to take back what they believe is theirs through violence and vengeance. And as the shadow of those cursed draws closer, the line between what is forbidden and what is right becomes blurred. Poppy is not only on the verge of losing her heart and being found unworthy by the gods, but also her life when every blood-soaked thread that holds her world together begins to unravel. Reviews for From Blood and Ash: \"Dreamy, twisty, steamy escapism. Take me back!\" -New York Times bestseller Wendy Higgins “Jennifer Armentrout has the power to control my emotions with every word she writes. From swooning to crying to racing through the pages to find out what happens next, I couldn't stop reading about Hawke and Poppy, and you won't be able to either.” - Brigid Kemmerer, New York Times Bestselling Author of A Curse So Dark and Lonely “Action, adventure, sexiness, and angst! From Blood and Ash has it all and double that. So many feels and so many moments it made me cheer for the character. Read. This. Book! You'll be obsessed!” - Tijan NYT bestselling author “From Blood and Ash is a phenomenal fantasy novel that is filled to the brim with danger, mystery and heart melting romance. I loved every single second of it and I couldn’t get enough of this new fantastical world. A heart stopping start to what is clearly going to be a stunning series, perfect for both those who love fantasy and those who are new to the genre. A must read.” Kayleigh, K-Books \"If you think you are ready for From Blood and Ash, think again. Jennifer L. Armentrout has woven a new fantasy universe that will leave you reeling. Filled with action, heart wrenching twists and the most delicious romance, this unputdownable novel comes with a warning: keep a fan close by, because the temperatures are about to rise.\" Elena, The Bibliotheque Blo “In this exciting new novel by Jennifer L. Armentrout, she introduces a fantastical world filled with immense detail, and characters who are poignant and fierce, Jennifer truly has out done herself!” – BookBesties “From Blood and Ash is a fantastic fantasy that will hook you immediately from the very first page! I loved every single moment and all of the characters are ones you will fall in love with! Jennifer L. Armentrout has done it again with her amazing writing skills and lots of detail! Get this book immediately!!!” - Amanda @Stuck In YA Books “Jennifer has stepped into the fantasy genre with this absolutely amazing novel. With characters you will love and more than a few twists and turns, get ready for one amazing adventure.” -Perpetual Fangirl \"This magnificent book has so many pieces in it: fantasy, mystery, forbidden romance, supernatural, lies, deceit, betrayal, love, friendship, family. And so, so, so many secrets your head will be spinning. Jennifer L. Armentrout has created another masterpiece that I will be rushing to buy, and will be telling everyone to read it ASAP!\" ~Jeraca @My Nose in YA Books “From Blood to Ash is the first high fantasy book from Jennifer L Armentrout, but hopefully not the last. Like all her other works, her ability to create worlds, create swoon worthy men, and feisty strong female characters is amazing. Fantasy, mystery, romance, betrayal, love, and steamy scenes, this book has it all.” - Lisa @ The Blonde Book Lover “From Blood & Ash is everything we love about JLA’s fantasy writing...pumped up on steroids. There’s epic world building and plot twists, a strong female lead, a swoon worthy book hottie, a steamy forbidden love story, and side characters that can’t help but steal your heart. My mind was blown by the end of this book.” - Kris S. (frantic4romantic) “Step into an exciting new fantasy world by Jennifer L. Armentrout, From Blood And Ash takes you on a fantastic ride with twists and turns galore. Characters you will love to laugh and cry with. A phenomenal start to an exciting new series.” - Lori Dunn an avid reader “From Blood and Ash was everything I wanted in a high fantasy novel. The myths, the legends, the epic romance, and an adventure that will keep you on your toes beginning to end. I couldn’t put the book down. Truly a brilliant start to what I believe will be yet another amazing series by Jennifer L. Armentrout.\" –Sabrina, Books Are My Life “Jennifer L. Armentrout takes her first step into the high fantasy genre with From Blood and Ash. A story of forbidden love, lies, secrets, and betrayal - it will leave you wanting more after the very last page.” - Love Just Is Books “From Blood and Ash is like reading my favorite book for first time.” - Raquel Herrera “With From Blood and Ash, Jennifer Armentrout successfully takes on the genre of high fantasy, proving, once again, that she is a master of her craft. Filled with epic adventure, forbidden romance, deceit, lies, and betrayal, FB&A draws you in from page one and refuses to let go!” - Erica, The Rest Just Falls Away “Jennifer L. Armentrout comes trough once again with From Blood and Ash as it kept me enthralled throughout the full book. You won't be able to put down this epic story once you start.” - Julalicious Book Paradise “From Blood and Ash strikes the perfect balance between fantasy and romance elements leaving the world feeling live in and full while allowing the relationship between the main characters feeling real and authentic.” - Nads Book Nook, Nadine Bergeron “Be prepared to spend your whole day reading From Blood and Ash. Once you start reading this high fantasy novel, you won't want to put it down.” - Love Book Triangle “From Blood and Ash is absolutely breath taking. JLA does what she does best by creating a fantastical world filled with romance, lies, betrayal, adventure and all things we love and expect from JLA characters that melt our hearts and steal our hearts and souls. I cannot wait for the next one!” - Pia Colon “From Blood and Ash, Jennifer L. Armentrout brought to life a high fantasy that is enthralling. Another masterful addition to my collection. Get ready to stay on your toes from start to end.” - Amy Oh, Reader by the Mountains “From Blood and Ash is the first high fantasy novel by Jennifer L Armentrout and she absolutely nails it. This is fantasy for skeptics and unbelievers because it makes you want to be a fantasy fan! This page turner makes you want to devour it in one night and at the same time savor every detail. Heart stopping and inspiring and grips you from page one.” – Tracy Kirby “An intriguing puzzle of a world, a ruthless hero, a determine heroin, and a plot that will keep you up late, this book is one of the best I've read this year.” – Valerie from Stuck In Books “From Blood and Ash, a thrilling high fantasy that packs a punch, each page will leave you wanting more!” - Tracey, Books & Other Pursuits",
        "cover_url": "http://books.google.com/books/content?id=SpXZDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": 8.99,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "R4VizQEACAAJ",
        "title": "From Blood and Ash",
        "authors": [
          "Jennifer L. Armentrout"
        ],
        "publisher": null,
        "isbn_10": "1951812239",
        "isbn_13": "9781951812232",
        "release_date": "2020-05-31",
        "page_count": null,
        "categories": [],
        "description": null,
        "cover_url": null,
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "oId0CQAAQBAJ",
        "title": "The Testament of Shadows: Coming Forth by Night and Descent from the Stars",
        "authors": [
          "T. Broussard"
        ],
        "publisher": "Lulu.com",
        "isbn_10": "1304187608",
        "isbn_13": "9781304187604",
        "release_date": null,
        "page_count": 478,
        "categories": [],
        "description": null,
        "cover_url": "http://books.google.com/books/content?id=oId0CQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "t5cQ0QEACAAJ",
        "title": "Blood and Ash Complete Series 4-Book Collection Set by Jennifer L. Armentrout (from Blood and Ash, a Kingdom of Flesh and Fire, the Crown of Gilded Bones, the War of Two Queens)",
        "authors": [
          "Jennifer L. Armentrout"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": "9798897222544",
        "release_date": "2022-05-24",
        "page_count": 0,
        "categories": [
          "Fiction"
        ],
        "description": null,
        "cover_url": null,
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": "Blood and Ash Complete",
        "series_position": 4
      },
      {
        "google_books_id": "74PqluhEvRcC",
        "title": "A Sword from Red Ice",
        "authors": [
          "J. V. Jones"
        ],
        "publisher": "Macmillan",
        "isbn_10": "1429992409",
        "isbn_13": "9781429992404",
        "release_date": "2008-12-30",
        "page_count": 738,
        "categories": [
          "Fiction"
        ],
        "description": "Master storyteller J. V. Jones (called \"a striking writer\" by Robert Jordan) weaves an unforgettable tale of ambition, betrayal, and the indomitable strength of the human spirit. This epic fantasy of enormous scope, set on a world peopled by fascinating, compelling characters, is a sharply observed saga of a cold, splintered world on the brink. A thousand years ago, war shook the land. Now, chaos has erupted. Clans vie for dominance; dangerous, arrogant clan chiefs urge their followers into frenzied battles, killing each other and plotting the defeat of their rivals despite those among them who seek unity. But for all the vicious contention among the clans, a darker threat comes from Spire Vanis, a city with a black heart of evil, whose rulers have long sought to control the clanholds. In the midst of the chaos, a few extraordinary people wrestle with personal demons: A born killer with only love and loyalty in his heart; a young woman whose mystical destiny is shrouded in her unknown past; a young man betrayed by his own brother; and a clanswoman who would do anything to save her folk. Each alone seeks only survival, but together they hold the keys to a world's salvation. At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
        "cover_url": "http://books.google.com/books/content?id=74PqluhEvRcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": 12.99,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "0Fh5N-i-c7AC",
        "title": "From Dust and Ashes",
        "authors": [
          "Tricia N. Goyer"
        ],
        "publisher": "Moody Publishers",
        "isbn_10": "0802479731",
        "isbn_13": "9780802479730",
        "release_date": "2008-09-01",
        "page_count": 464,
        "categories": [
          "Fiction"
        ],
        "description": "It is 1945 and a group of American soldiers liberate a Nazi concentration camp. Helene is the abandoned wife of an SS guard who has fled to avoid arrest. Overcome by guilt, she begins to help meet the needs of survivors. Throughout the process, she finds her own liberation - from spiritual bondage, sin, and guilt. Readers will be intrigued and touched by this fascinating story of love, faithfulness, and courage amidst one of the darkest chapters of mankind's history.",
        "cover_url": "http://books.google.com/books/content?id=0Fh5N-i-c7AC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "eAaiEAAAQBAJ",
        "title": "Lieutenant: Tales from the Super Continent",
        "authors": [
          "Peter Hilditch"
        ],
        "publisher": "Austin Macauley Publishers",
        "isbn_10": "1528989619",
        "isbn_13": "9781528989619",
        "release_date": "2023-01-06",
        "page_count": 266,
        "categories": [
          "Young Adult Fiction"
        ],
        "description": "In the far-flung future, humanity has regressed to an endless warring period. Skill with a forged weapon is king now. Jesse was born on the streets but has always dreamed of becoming a warrior himself. Maybe even a lieutenant? But in this world of endless warfare can anyone take control of the whole continent?",
        "cover_url": "http://books.google.com/books/content?id=eAaiEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": 4.5,
        "format": "book",
        "source": "google_books",
        "series_name": "Lieutenant:",
        "series_position": null
      },
      {
        "google_books_id": "9HBOAgAAQBAJ",
        "title": "Hidden from Men: The Awakened Book Five",
        "authors": [
          "Jason Tesar"
        ],
        "publisher": "4shadow LLC",
        "isbn_10": "1494219581",
        "isbn_13": "9781494219581",
        "release_date": "2013-11-19",
        "page_count": 287,
        "categories": [
          "Fiction"
        ],
        "description": "A powerful adversary is surfacing and Null’s covert battle is on the threshold of open war. Reunited with his father after twenty-two years, Kael must find the balance between protecting him and confronting the enemy who stands between them and their home world. The timelessness of the In-Between has stolen the years that separated Kael and Adair by age, leaving them as distant equals. Having glimpsed Kael’s destiny from the Eternal Realm, Adair struggles to find his role in the life of a son who no longer needs him. Through a global maze of counterintelligence and espionage, a multinational team of operatives has to survive long enough to turn the tide of war. And a father and son will discover how to rebuild what was taken from their lives. In book five of the bestselling Awakened series, Jason Tesar’s epic saga escapes the islands of Scandinavia for the dark forests and rugged mountains of Russia in a tense conflict of subterfuge that blurs the boundaries between sci-fantasy and military fiction.",
        "cover_url": "http://books.google.com/books/content?id=9HBOAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "HKFwEQAAQBAJ",
        "title": "From Fire To AI",
        "authors": [
          "Curtis Coumbe, PhD."
        ],
        "publisher": "Singularity Publications ",
        "isbn_10": null,
        "isbn_13": "9798999139368",
        "release_date": "2025-06-27",
        "page_count": 199,
        "categories": [
          "Philosophy"
        ],
        "description": "From Fire to AI is a sweeping fusion of science, technology, and human evolution, tracing the arc of civilization from ancient flame to the rise of artificial intelligence. Through a blend of history, physics, philosophy, and mythic insight, author Curtis E. Coumbe, Ph.D., reveals the patterns that have guided humanity from survival to transcendence. This is more than a history of innovation-it's a blueprint for what comes next. From the invention of language and mathematics to the mysteries of quantum physics and brain-computer interfaces, Coumbe invites readers into a transformative journey across time, consciousness, and the digital frontier. From Fire to AI dares to ask not just how far we've come... but who we are becoming.",
        "cover_url": "http://books.google.com/books/content?id=HKFwEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": 5.99,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL27838518W",
        "title": "From Blood and Ash",
        "authors": [
          "Jennifer L. Armentrout"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2020-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/14105538-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL22535730W",
        "title": "From Blood and Ash",
        "authors": [
          "Jennifer L. Armentrout",
          "Stina Nielsen"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2020-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/10474893-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL21279423W",
        "title": "From Blood and Ash",
        "authors": [
          "Jennifer L. Armentrout"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2020-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/10359194-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL34410341W",
        "title": "From Blood and Ash",
        "authors": [
          "deifoli assil"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2021-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL36724370W",
        "title": "From Blood and Ash",
        "authors": [
          "Jennifer L. Armentrout"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2023-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL42560400W",
        "title": "Blood and Ash Complete Series 4-Book Collection Set by Jennifer L. Armentrout (from Blood and Ash, a Kingdom of Flesh and Fire, the Crown of Gilded Bones, the War of Two Queens)",
        "authors": [
          "Jennifer L. Armentrout"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2022-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL36264168W",
        "title": "Blood and Ash Series 4-Book & Flesh and Fire #2 Collection Set by Jennifer L. Armentrout (from Blood and Ash, a Kingdom of Flesh and Fire, the Crown of Gilded Bones, the War of Two Queens, a Light in the Flame)",
        "authors": [
          "Jennifer L. Armentrout"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2022-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": "Blood and Ash Series 4-Book & Flesh and Fire",
        "series_position": 2
      },
      {
        "openlibrary_id": "/works/OL43713625W",
        "title": "A preliminary statement of the alkalinity of the blood in infections and the infusion of salts derived from horse's blood-ash as a therapeutic measure",
        "authors": [
          "A. Emil Schmitt"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1902-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      }
    ],
    "cached_at": "2025-07-27T18:19:43.238230"
  },
  "title_lor": {
    "data": [
      {
        "google_books_id": "qwokAQAAIAAJ",
        "title": "The Encyclopaedia Britannica: Lor to Mun",
        "authors": [],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1911-01-01",
        "page_count": 1056,
        "categories": [
          "Encyclopedias and dictionaries"
        ],
        "description": null,
        "cover_url": "http://books.google.com/books/content?id=qwokAQAAIAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "B6Sf661VRm8C",
        "title": "Mi-Lor, Inc. V. Charter Oak Fire Insurance Company",
        "authors": [],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1980-01-01",
        "page_count": 24,
        "categories": [],
        "description": null,
        "cover_url": "http://books.google.com/books/content?id=B6Sf661VRm8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "LOr-A9tY50IC",
        "title": "Hearings",
        "authors": [
          "United States. Congress. House"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1948-01-01",
        "page_count": 3176,
        "categories": [],
        "description": null,
        "cover_url": "http://books.google.com/books/content?id=LOr-A9tY50IC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "GbQFAQAAQBAJ",
        "title": "Lor Banesmith",
        "authors": [
          "Al Leigh"
        ],
        "publisher": "Xlibris Corporation",
        "isbn_10": "1483692302",
        "isbn_13": "9781483692302",
        "release_date": "2013-08-31",
        "page_count": 160,
        "categories": [
          "Fiction"
        ],
        "description": "Welcome to Phinea, a world where three Suns keep night at bay. Most people have one name and an ordinary life, but a select few have a Name, a Bloodline, and a Fate. Trathe is a warrior beyond legend, but he is unaware of this until the age of nineteen. On the journey to fulfill his destiny, Trathe, led by his father, encounter lands and powers beyond anything he could have imagined.",
        "cover_url": "http://books.google.com/books/content?id=GbQFAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": 3.99,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "SH4cMIiltqoC",
        "title": "The Encyclopaedia Britannica: Ita to Lor",
        "authors": [],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1911-01-01",
        "page_count": 1098,
        "categories": [
          "Encyclopedias and dictionaries"
        ],
        "description": null,
        "cover_url": "http://books.google.com/books/content?id=SH4cMIiltqoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "gnqFzwEACAAJ",
        "title": "The Ainu and Their Folk-lor",
        "authors": [
          "John Batchelor"
        ],
        "publisher": "Legare Street Press",
        "isbn_10": "1016604246",
        "isbn_13": "9781016604246",
        "release_date": "2022-10-27",
        "page_count": 0,
        "categories": [],
        "description": "This work has been selected by scholars as being culturally important, and is part of the knowledge base of civilization as we know it. This work is in the \"public domain in the United States of America, and possibly other nations. Within the United States, you may freely copy and distribute this work, as no entity (individual or corporate) has a copyright on the body of the work. Scholars believe, and we concur, that this work is important enough to be preserved, reproduced, and made generally available to the public. We appreciate your support of the preservation process, and thank you for being an important part of keeping this knowledge alive and relevant.",
        "cover_url": "http://books.google.com/books/content?id=gnqFzwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "Bxit6MntszYC",
        "title": "Lor Mandela - Destruction From Twins",
        "authors": [
          "L. Carroll"
        ],
        "publisher": "The eBook Sale",
        "isbn_10": "1849610460",
        "isbn_13": "9781849610469",
        "release_date": "2010-01-01",
        "page_count": 376,
        "categories": [
          "Magicians"
        ],
        "description": "When a selfish enchantress seeks to steal mystical powers from her twin sister, she sentences the world of Lor Mandela and its inhabitants to death. In an effort to preserve itself, the soul of the planet appoints a Child of Balance named Audril Borloc who must solve a prophetic riddle known as the Advantiere. All hope seems lost, however, when shortly after her fourth birthday, Audril disappears without a trace.",
        "cover_url": "http://books.google.com/books/content?id=Bxit6MntszYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "lOR-EAAAQBAJ",
        "title": "Divine Intervention",
        "authors": [
          "Russell Keeler"
        ],
        "publisher": "Christian Faith Publishing, Inc.",
        "isbn_10": "1685175163",
        "isbn_13": "9781685175160",
        "release_date": "2022-08-01",
        "page_count": 60,
        "categories": [
          "Biography & Autobiography"
        ],
        "description": "Have you ever been delayed--maybe a red light, traffic jam, or you just couldn't find your keys or phone--and it upset you? How about awakened after a dream that seemed so real that it took you a few minutes to realize it was just a dream? Divine Intervention: One Man's Story is a journey of amazing real-life situations that not only saved the life of the author but also possibly saved the lives of others. Each chapter details encounters that can only be explained as God's divine grace, as well as divine connections that pushed the author to levels in life not ever imagined. Each story will draw you into his childhood and adult life and open your eyes to your own memories of when God stepped in for you. Is it possible that delay kept you from harm? Is that dream that seems so real a dream to help comfort you in a given situation? This biblical perspective of God's grace shares verses to tell you of his greatness and his timing in our lives. It's not about our timing; it's God's timing that will get us through life and to the destination he has planned for you. Are you ready for this great journey--life?",
        "cover_url": "http://books.google.com/books/content?id=lOR-EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": 9.99,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "LOr-wAEACAAJ",
        "title": "Language and Social Behaviour",
        "authors": [
          "William Peter Robinson"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1974-01-01",
        "page_count": 223,
        "categories": [
          "Sociolinguistics"
        ],
        "description": null,
        "cover_url": null,
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "LoR-xAEACAAJ",
        "title": "The Edinburgh Review: Or Critical Journal",
        "authors": [
          "Anonymous"
        ],
        "publisher": "Wentworth Press",
        "isbn_10": "1010889125",
        "isbn_13": "9781010889120",
        "release_date": "2019-03-23",
        "page_count": 246,
        "categories": [
          "History"
        ],
        "description": "This work has been selected by scholars as being culturally important, and is part of the knowledge base of civilization as we know it. This work was reproduced from the original artifact, and remains as true to the original work as possible. Therefore, you will see the original copyright references, library stamps (as most of these works have been housed in our most important libraries around the world), and other notations in the work. This work is in the public domain in the United States of America, and possibly other nations. Within the United States, you may freely copy and distribute this work, as no entity (individual or corporate) has a copyright on the body of the work. As a reproduction of a historical artifact, this work may contain missing or blurred pages, poor pictures, errant marks, etc. Scholars believe, and we concur, that this work is important enough to be preserved, reproduced, and made generally available to the public. We appreciate your support of the preservation process, and thank you for being an important part of keeping this knowledge alive and relevant.",
        "cover_url": "http://books.google.com/books/content?id=LoR-xAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL3543921W",
        "title": "Tintin au pays de l'or noir",
        "authors": [
          "Hergé"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1961-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/8728166-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL1344309W",
        "title": "Défense de l'or",
        "authors": [
          "Rist, Charles"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1953-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/9598498-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL5284153W",
        "title": "LORS",
        "authors": [
          "Joseph William Hollis"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1975-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/11673419-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL32718473W",
        "title": "L'or et le sang",
        "authors": [
          "Maurin Defrance"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2014-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL1297554W",
        "title": "Le sang et l'or",
        "authors": [
          "Julien Unger"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1946-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL7853952W",
        "title": "De l'or",
        "authors": [
          "Henri Landrin"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1851-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL24427660W",
        "title": "The Ainu and Their Folk-lor",
        "authors": [
          "John Batchelor"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2018-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/10990859-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL1651674W",
        "title": "De l'or et des épices",
        "authors": [
          "Jean Favier"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1987-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/7987717-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL22031139W",
        "title": "Custode Di Roch'lor",
        "authors": [
          "Norma Tarditi"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2020-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/14692657-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL7853956W",
        "title": "Traité de l'or",
        "authors": [
          "Henri Landrin"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1863-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      }
    ],
    "cached_at": "2025-07-27T22:06:27.512541"
  },
  "title_harry potter": {
    "data": [
      {
        "google_books_id": "wrOQLV6xB-wC",
        "title": "Harry Potter and the Sorcerer's Stone",
        "authors": [
          "J.K. Rowling"
        ],
        "publisher": "Pottermore Publishing",
        "isbn_10": "1781100489",
        "isbn_13": "9781781100486",
        "release_date": "2015-12-08",
        "page_count": 312,
        "categories": [
          "Juvenile Fiction"
        ],
        "description": "Turning the envelope over, his hand trembling, Harry saw a purple wax seal bearing a coat of arms; a lion, an eagle, a badger and a snake surrounding a large letter 'H'. Harry Potter has never even heard of Hogwarts when the letters start dropping on the doormat at number four, Privet Drive. Addressed in green ink on yellowish parchment with a purple seal, they are swiftly confiscated by his grisly aunt and uncle. Then, on Harry's eleventh birthday, a great beetle-eyed giant of a man called Rubeus Hagrid bursts in with some astonishing news: Harry Potter is a wizard, and he has a place at Hogwarts School of Witchcraft and Wizardry. An incredible adventure is about to begin! Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
        "cover_url": "http://books.google.com/books/content?id=wrOQLV6xB-wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": 11.99,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "_oaAHiFOZmgC",
        "title": "Harry Potter and the Deathly Hallows",
        "authors": [
          "J.K. Rowling"
        ],
        "publisher": "Pottermore Publishing",
        "isbn_10": "1781102430",
        "isbn_13": "9781781102435",
        "release_date": "2015-12-08",
        "page_count": 771,
        "categories": [
          "Juvenile Fiction"
        ],
        "description": "'Give me Harry Potter,' said Voldemort's voice, 'and none shall be harmed. Give me Harry Potter, and I shall leave the school untouched. Give me Harry Potter, and you will be rewarded.' As he climbs into the sidecar of Hagrid's motorbike and takes to the skies, leaving Privet Drive for the last time, Harry Potter knows that Lord Voldemort and the Death Eaters are not far behind. The protective charm that has kept Harry safe until now is broken, but he cannot keep hiding. The Dark Lord is breathing fear into everything Harry loves and to stop him Harry will have to find and destroy the remaining Horcruxes. The final battle must begin - Harry must stand and face his enemy... Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
        "cover_url": "http://books.google.com/books/content?id=_oaAHiFOZmgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": 11.99,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "lJB5DwAAQBAJ",
        "title": "The Ultimate Harry Potter and Philosophy",
        "authors": [
          "William Irwin",
          "Gregory Bassham"
        ],
        "publisher": "John Wiley & Sons",
        "isbn_10": "0470398256",
        "isbn_13": "9780470398258",
        "release_date": "2010-09-14",
        "page_count": 311,
        "categories": [
          "Philosophy"
        ],
        "description": "A philosophical exploration of the entire seven-book Harry Potter series Harry Potter has been heralded as one of the most popular book series of all time and the philosophical nature of Harry, Hermione, and Ron's quest to rid the world of its ultimate evil is one of the many things that make this series special. The Ultimate Harry Potter and Philosophy covers all seven titles in J.K. Rowling's groundbreaking series and takes fans back to Godric's Hollow to discuss life after death, to consider what moral reasoning drove Harry to choose death, and to debate whether Sirius Black is a man or a dog. With publication timed to coincide with the release of the movie Harry Potter and the Deathly Hallows (Part 1), this book will be the definitive guide for all fans looking to appreciate the series on a deeper level. Covers a range of intriguing topics such as the redemption of Severus Snape, the power of love, and destiny in the wizarding world Gives you a new perspective on Harry Potter characters, plot lines, and themes Makes a perfect companion to the Harry Potter books and movies Packed with interesting ideas and insights, The Ultimate Harry Potter and Philosophy is an ideal companion for anyone interested in unraveling the subtext and exploring the greater issues at work in the story.",
        "cover_url": "http://books.google.com/books/content?id=lJB5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "R7YsowJI9-IC",
        "title": "Harry Potter and the Half-Blood Prince",
        "authors": [
          "J.K. Rowling"
        ],
        "publisher": "Pottermore Publishing",
        "isbn_10": "1781100543",
        "isbn_13": "9781781100547",
        "release_date": "2015-12-08",
        "page_count": 661,
        "categories": [
          "Juvenile Fiction"
        ],
        "description": "There it was, hanging in the sky above the school: the blazing green skull with a serpent tongue, the mark Death Eaters left behind whenever they had entered a building... wherever they had murdered... When Dumbledore arrives at Privet Drive one summer night to collect Harry Potter, his wand hand is blackened and shrivelled, but he does not reveal why. Secrets and suspicion are spreading through the wizarding world, and Hogwarts itself is not safe. Harry is convinced that Malfoy bears the Dark Mark: there is a Death Eater amongst them. Harry will need powerful magic and true friends as he explores Voldemort's darkest secrets, and Dumbledore prepares him to face his destiny... Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
        "cover_url": "http://books.google.com/books/content?id=R7YsowJI9-IC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": 11.99,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "nmXTy4FPfcwC",
        "title": "Harry Potter and the Chamber of Secrets",
        "authors": [
          "J. K. Rowling"
        ],
        "publisher": "Raincoast Books",
        "isbn_10": "1551922444",
        "isbn_13": "9781551922447",
        "release_date": "1999-01-01",
        "page_count": 260,
        "categories": [
          "Juvenile Fiction"
        ],
        "description": "Witchcraft, wizardry - fiction.",
        "cover_url": "http://books.google.com/books/content?id=nmXTy4FPfcwC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "etukl7GfrxQC",
        "title": "Harry Potter and the Goblet of Fire",
        "authors": [
          "J.K. Rowling"
        ],
        "publisher": "Pottermore Publishing",
        "isbn_10": "1781100527",
        "isbn_13": "9781781100523",
        "release_date": "2015-12-08",
        "page_count": 757,
        "categories": [
          "Juvenile Fiction"
        ],
        "description": "'There will be three tasks, spaced throughout the school year, and they will test the champions in many different ways ... their magical prowess - their daring - their powers of deduction - and, of course, their ability to cope with danger.' The Triwizard Tournament is to be held at Hogwarts. Only wizards who are over seventeen are allowed to enter - but that doesn't stop Harry dreaming that he will win the competition. Then at Hallowe'en, when the Goblet of Fire makes its selection, Harry is amazed to find his name is one of those that the magical cup picks out. He will face death-defying tasks, dragons and Dark wizards, but with the help of his best friends, Ron and Hermione, he might just make it through - alive! Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
        "cover_url": "http://books.google.com/books/content?id=etukl7GfrxQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": 11.99,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "Sm5AKLXKxHgC",
        "title": "Harry Potter and the Prisoner of Azkaban",
        "authors": [
          "J.K. Rowling"
        ],
        "publisher": "Pottermore Publishing",
        "isbn_10": "1781100519",
        "isbn_13": "9781781100516",
        "release_date": "2015-12-08",
        "page_count": 451,
        "categories": [
          "Juvenile Fiction"
        ],
        "description": "'Welcome to the Knight Bus, emergency transport for the stranded witch or wizard. Just stick out your wand hand, step on board and we can take you anywhere you want to go.' When the Knight Bus crashes through the darkness and screeches to a halt in front of him, it's the start of another far from ordinary year at Hogwarts for Harry Potter. Sirius Black, escaped mass-murderer and follower of Lord Voldemort, is on the run - and they say he is coming after Harry. In his first ever Divination class, Professor Trelawney sees an omen of death in Harry's tea leaves... But perhaps most terrifying of all are the Dementors patrolling the school grounds, with their soul-sucking kiss... Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
        "cover_url": "http://books.google.com/books/content?id=Sm5AKLXKxHgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": 11.99,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "ufM5PgAACAAJ",
        "title": "Harry Potter and the Philosopher's Stone",
        "authors": [
          "J. K. Rowling"
        ],
        "publisher": null,
        "isbn_10": "0563533382",
        "isbn_13": "9780563533382",
        "release_date": "2001-11-01",
        "page_count": 12,
        "categories": [],
        "description": "An adult edition of the hugely popular book. Find out how Harry discovers his true heritage at Hogwarts School of Wizardry and Witchcraft, the reason behind his parents mysterious death, who is out to kill him, and how he uncovers the most fabled secret of all time.",
        "cover_url": "http://books.google.com/books/content?id=ufM5PgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "AAjjRgAACAAJ",
        "title": "Harry Potter",
        "authors": [
          "J. K. Rowling"
        ],
        "publisher": "Bloomsbury UK",
        "isbn_10": "1408812525",
        "isbn_13": "9781408812525",
        "release_date": "2010-10-28",
        "page_count": 7,
        "categories": [
          "Children's stories, English"
        ],
        "description": "A boxed set incorporating the complete set of 'Signature' edition Harry Potter titles. Including the titles - 'Philosopher's Stone'; 'Chamber of Secrets'; 'Prisoner of Azkaban'; 'Goblet of Fire'; 'Order of the Phoenix'; 'The Half-blood Prince'; 'The Deathly Hallows'.",
        "cover_url": "http://books.google.com/books/content?id=AAjjRgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "kpnHBAAAQBAJ",
        "title": "Harry Potter and the Order of the Phoenix",
        "authors": [
          "J. K. Rowling"
        ],
        "publisher": "Bloomsbury Publishing",
        "isbn_10": "1408855690",
        "isbn_13": "9781408855690",
        "release_date": "2014-09-01",
        "page_count": 817,
        "categories": [
          "Fiction"
        ],
        "description": "Celebrate 20 years of Harry Potter magic! Dark times have come to Hogwarts. After the Dementors' attack on his cousin Dudley, Harry Potter knows that Voldemort will stop at nothing to find him. There are many who deny the Dark Lord's return, but Harry is not alone: a secret order gathers at Grimmauld Place to fight against the Dark forces. Harry must allow Professor Snape to teach him how to protect himself from Voldemort's savage assaults on his mind. But they are growing stronger by the day and Harry is running out of time.These new editions of the classic and internationally bestselling, multi-award-winning series feature instantly pick-up-able new jackets by Jonny Duddle, with huge child appeal, to bring Harry Potter to the next generation of readers. It's time to PASS THE MAGIC ON ...",
        "cover_url": "http://books.google.com/books/content?id=kpnHBAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL82586W",
        "title": "Harry Potter and the Deathly Hallows",
        "authors": [
          "J. K. Rowling"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2007-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/10110415-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL82563W",
        "title": "Harry Potter and the Philosopher's Stone",
        "authors": [
          "J. K. Rowling"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1997-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/10521270-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL82536W",
        "title": "Harry Potter and the Prisoner of Azkaban",
        "authors": [
          "J. K. Rowling"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1999-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/10580435-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL82537W",
        "title": "Harry Potter and the Chamber of Secrets",
        "authors": [
          "J. K. Rowling"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1998-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/8392798-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL82560W",
        "title": "Harry Potter and the Goblet of Fire",
        "authors": [
          "J. K. Rowling",
          "Jim Kay"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1993-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/12059372-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL82565W",
        "title": "Harry Potter and the Half-Blood Prince",
        "authors": [
          "J. K. Rowling",
          "Mary GrandPré"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2005-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/10716273-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL82548W",
        "title": "Harry Potter and the Order of the Phoenix",
        "authors": [
          "J. K. Rowling"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2003-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/10523466-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL17360811W",
        "title": "Harry Potter and the Cursed Child",
        "authors": [
          "Jack Thorne",
          "John Tiffany",
          "J. K. Rowling"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2001-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/8763851-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL14981609W",
        "title": "Harry Potter (series) 1-7",
        "authors": [
          "J. K. Rowling"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1999-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/8457523-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL21385222W",
        "title": "Harry Potter",
        "authors": [
          "J. K. Rowling"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2001-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      }
    ],
    "cached_at": "2025-07-27T22:06:32.607665"
  },
  "isbn_9781781100486": {
    "data": {
      "google_books_id": "wrOQLV6xB-wC",
      "title": "Harry Potter and the Sorcerer's Stone",
      "authors": [
        "J.K. Rowling"
      ],
      "publisher": "Pottermore Publishing",
      "isbn_10": "1781100489",
      "isbn_13": "9781781100486",
      "release_date": "2015-12-08",
      "page_count": 312,
      "categories": [
        "Juvenile Fiction"
      ],
      "description": "Turning the envelope over, his hand trembling, Harry saw a purple wax seal bearing a coat of arms; a lion, an eagle, a badger and a snake surrounding a large letter 'H'. Harry Potter has never even heard of Hogwarts when the letters start dropping on the doormat at number four, Privet Drive. Addressed in green ink on yellowish parchment with a purple seal, they are swiftly confiscated by his grisly aunt and uncle. Then, on Harry's eleventh birthday, a great beetle-eyed giant of a man called Rubeus Hagrid bursts in with some astonishing news: Harry Potter is a wizard, and he has a place at Hogwarts School of Witchcraft and Wizardry. An incredible adventure is about to begin! Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
      "cover_url": "http://books.google.com/books/content?id=wrOQLV6xB-wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "price": 11.99,
      "format": "book",
      "source": "google_books",
      "series_name": null,
      "series_position": null
    },
    "cached_at": "2025-07-27T22:06:35.431326"
  }
}