{
  "title_from blood and ash": {
    "data": [
      {
        "google_books_id": "SpXZDwAAQBAJ",
        "title": "From Blood and Ash",
        "authors": [
          "Jennifer L. Armentrout"
        ],
        "publisher": "Blue Box Press",
        "isbn_10": "1952457017",
        "isbn_13": "9781952457012",
        "release_date": "2020-03-30",
        "page_count": 345,
        "categories": [
          "Fiction"
        ],
        "description": "Captivating and action-packed, From Blood and Ash is a sexy, addictive, and unexpected fantasy perfect for fans of Sarah J. Maas and Laura Thalassa. A Maiden… Chosen from birth to usher in a new era, Poppy’s life has never been her own. The life of the Maiden is solitary. Never to be touched. Never to be looked upon. Never to be spoken to. Never to experience pleasure. Waiting for the day of her Ascension, she would rather be with the guards, fighting back the evil that took her family, than preparing to be found worthy by the gods. But the choice has never been hers. A Duty… The entire kingdom’s future rests on Poppy’s shoulders, something she’s not even quite sure she wants for herself. Because a Maiden has a heart. And a soul. And longing. And when Hawke, a golden-eyed guard honor bound to ensure her Ascension, enters her life, destiny and duty become tangled with desire and need. He incites her anger, makes her question everything she believes in, and tempts her with the forbidden. A Kingdom… Forsaken by the gods and feared by mortals, a fallen kingdom is rising once more, determined to take back what they believe is theirs through violence and vengeance. And as the shadow of those cursed draws closer, the line between what is forbidden and what is right becomes blurred. Poppy is not only on the verge of losing her heart and being found unworthy by the gods, but also her life when every blood-soaked thread that holds her world together begins to unravel. Reviews for From Blood and Ash: \"Dreamy, twisty, steamy escapism. Take me back!\" -New York Times bestseller Wendy Higgins “Jennifer Armentrout has the power to control my emotions with every word she writes. From swooning to crying to racing through the pages to find out what happens next, I couldn't stop reading about Hawke and Poppy, and you won't be able to either.” - Brigid Kemmerer, New York Times Bestselling Author of A Curse So Dark and Lonely “Action, adventure, sexiness, and angst! From Blood and Ash has it all and double that. So many feels and so many moments it made me cheer for the character. Read. This. Book! You'll be obsessed!” - Tijan NYT bestselling author “From Blood and Ash is a phenomenal fantasy novel that is filled to the brim with danger, mystery and heart melting romance. I loved every single second of it and I couldn’t get enough of this new fantastical world. A heart stopping start to what is clearly going to be a stunning series, perfect for both those who love fantasy and those who are new to the genre. A must read.” Kayleigh, K-Books \"If you think you are ready for From Blood and Ash, think again. Jennifer L. Armentrout has woven a new fantasy universe that will leave you reeling. Filled with action, heart wrenching twists and the most delicious romance, this unputdownable novel comes with a warning: keep a fan close by, because the temperatures are about to rise.\" Elena, The Bibliotheque Blo “In this exciting new novel by Jennifer L. Armentrout, she introduces a fantastical world filled with immense detail, and characters who are poignant and fierce, Jennifer truly has out done herself!” – BookBesties “From Blood and Ash is a fantastic fantasy that will hook you immediately from the very first page! I loved every single moment and all of the characters are ones you will fall in love with! Jennifer L. Armentrout has done it again with her amazing writing skills and lots of detail! Get this book immediately!!!” - Amanda @Stuck In YA Books “Jennifer has stepped into the fantasy genre with this absolutely amazing novel. With characters you will love and more than a few twists and turns, get ready for one amazing adventure.” -Perpetual Fangirl \"This magnificent book has so many pieces in it: fantasy, mystery, forbidden romance, supernatural, lies, deceit, betrayal, love, friendship, family. And so, so, so many secrets your head will be spinning. Jennifer L. Armentrout has created another masterpiece that I will be rushing to buy, and will be telling everyone to read it ASAP!\" ~Jeraca @My Nose in YA Books “From Blood to Ash is the first high fantasy book from Jennifer L Armentrout, but hopefully not the last. Like all her other works, her ability to create worlds, create swoon worthy men, and feisty strong female characters is amazing. Fantasy, mystery, romance, betrayal, love, and steamy scenes, this book has it all.” - Lisa @ The Blonde Book Lover “From Blood & Ash is everything we love about JLA’s fantasy writing...pumped up on steroids. There’s epic world building and plot twists, a strong female lead, a swoon worthy book hottie, a steamy forbidden love story, and side characters that can’t help but steal your heart. My mind was blown by the end of this book.” - Kris S. (frantic4romantic) “Step into an exciting new fantasy world by Jennifer L. Armentrout, From Blood And Ash takes you on a fantastic ride with twists and turns galore. Characters you will love to laugh and cry with. A phenomenal start to an exciting new series.” - Lori Dunn an avid reader “From Blood and Ash was everything I wanted in a high fantasy novel. The myths, the legends, the epic romance, and an adventure that will keep you on your toes beginning to end. I couldn’t put the book down. Truly a brilliant start to what I believe will be yet another amazing series by Jennifer L. Armentrout.\" –Sabrina, Books Are My Life “Jennifer L. Armentrout takes her first step into the high fantasy genre with From Blood and Ash. A story of forbidden love, lies, secrets, and betrayal - it will leave you wanting more after the very last page.” - Love Just Is Books “From Blood and Ash is like reading my favorite book for first time.” - Raquel Herrera “With From Blood and Ash, Jennifer Armentrout successfully takes on the genre of high fantasy, proving, once again, that she is a master of her craft. Filled with epic adventure, forbidden romance, deceit, lies, and betrayal, FB&A draws you in from page one and refuses to let go!” - Erica, The Rest Just Falls Away “Jennifer L. Armentrout comes trough once again with From Blood and Ash as it kept me enthralled throughout the full book. You won't be able to put down this epic story once you start.” - Julalicious Book Paradise “From Blood and Ash strikes the perfect balance between fantasy and romance elements leaving the world feeling live in and full while allowing the relationship between the main characters feeling real and authentic.” - Nads Book Nook, Nadine Bergeron “Be prepared to spend your whole day reading From Blood and Ash. Once you start reading this high fantasy novel, you won't want to put it down.” - Love Book Triangle “From Blood and Ash is absolutely breath taking. JLA does what she does best by creating a fantastical world filled with romance, lies, betrayal, adventure and all things we love and expect from JLA characters that melt our hearts and steal our hearts and souls. I cannot wait for the next one!” - Pia Colon “From Blood and Ash, Jennifer L. Armentrout brought to life a high fantasy that is enthralling. Another masterful addition to my collection. Get ready to stay on your toes from start to end.” - Amy Oh, Reader by the Mountains “From Blood and Ash is the first high fantasy novel by Jennifer L Armentrout and she absolutely nails it. This is fantasy for skeptics and unbelievers because it makes you want to be a fantasy fan! This page turner makes you want to devour it in one night and at the same time savor every detail. Heart stopping and inspiring and grips you from page one.” – Tracy Kirby “An intriguing puzzle of a world, a ruthless hero, a determine heroin, and a plot that will keep you up late, this book is one of the best I've read this year.” – Valerie from Stuck In Books “From Blood and Ash, a thrilling high fantasy that packs a punch, each page will leave you wanting more!” - Tracey, Books & Other Pursuits",
        "cover_url": "http://books.google.com/books/content?id=SpXZDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": 8.99,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "R4VizQEACAAJ",
        "title": "From Blood and Ash",
        "authors": [
          "Jennifer L. Armentrout"
        ],
        "publisher": null,
        "isbn_10": "1951812239",
        "isbn_13": "9781951812232",
        "release_date": "2020-05-31",
        "page_count": null,
        "categories": [],
        "description": null,
        "cover_url": null,
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "t5cQ0QEACAAJ",
        "title": "Blood and Ash Complete Series 4-Book Collection Set by Jennifer L. Armentrout (from Blood and Ash, a Kingdom of Flesh and Fire, the Crown of Gilded Bones, the War of Two Queens)",
        "authors": [
          "Jennifer L. Armentrout"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": "9798897222544",
        "release_date": "2022-05-24",
        "page_count": 0,
        "categories": [
          "Fiction"
        ],
        "description": null,
        "cover_url": null,
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": "Blood and Ash Complete",
        "series_position": 4
      },
      {
        "google_books_id": "oId0CQAAQBAJ",
        "title": "The Testament of Shadows: Coming Forth by Night and Descent from the Stars",
        "authors": [
          "T. Broussard"
        ],
        "publisher": "Lulu.com",
        "isbn_10": "1304187608",
        "isbn_13": "9781304187604",
        "release_date": null,
        "page_count": 478,
        "categories": [],
        "description": null,
        "cover_url": "http://books.google.com/books/content?id=oId0CQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "74PqluhEvRcC",
        "title": "A Sword from Red Ice",
        "authors": [
          "J. V. Jones"
        ],
        "publisher": "Macmillan",
        "isbn_10": "1429992409",
        "isbn_13": "9781429992404",
        "release_date": "2008-12-30",
        "page_count": 738,
        "categories": [
          "Fiction"
        ],
        "description": "Master storyteller J. V. Jones (called \"a striking writer\" by Robert Jordan) weaves an unforgettable tale of ambition, betrayal, and the indomitable strength of the human spirit. This epic fantasy of enormous scope, set on a world peopled by fascinating, compelling characters, is a sharply observed saga of a cold, splintered world on the brink. A thousand years ago, war shook the land. Now, chaos has erupted. Clans vie for dominance; dangerous, arrogant clan chiefs urge their followers into frenzied battles, killing each other and plotting the defeat of their rivals despite those among them who seek unity. But for all the vicious contention among the clans, a darker threat comes from Spire Vanis, a city with a black heart of evil, whose rulers have long sought to control the clanholds. In the midst of the chaos, a few extraordinary people wrestle with personal demons: A born killer with only love and loyalty in his heart; a young woman whose mystical destiny is shrouded in her unknown past; a young man betrayed by his own brother; and a clanswoman who would do anything to save her folk. Each alone seeks only survival, but together they hold the keys to a world's salvation. At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
        "cover_url": "http://books.google.com/books/content?id=74PqluhEvRcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": 12.99,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "ZKAF0AEACAAJ",
        "title": "Blood and Ash Series 4-Book & Flesh and Fire #2 Collection Set by Jennifer L. Armentrout (from Blood and Ash, a Kingdom of Flesh and Fire, the Crown of Gilded Bones, the War of Two Queens, a Light in the Flame)",
        "authors": [
          "Jennifer L. Armentrout"
        ],
        "publisher": null,
        "isbn_10": "1637990154",
        "isbn_13": "9781637990155",
        "release_date": "2022-12-15",
        "page_count": 0,
        "categories": [],
        "description": null,
        "cover_url": null,
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": "Blood and Ash Series 4-Book & Flesh and Fire",
        "series_position": 2
      },
      {
        "google_books_id": "0Fh5N-i-c7AC",
        "title": "From Dust and Ashes",
        "authors": [
          "Tricia N. Goyer"
        ],
        "publisher": "Moody Publishers",
        "isbn_10": "0802479731",
        "isbn_13": "9780802479730",
        "release_date": "2008-09-01",
        "page_count": 464,
        "categories": [
          "Fiction"
        ],
        "description": "It is 1945 and a group of American soldiers liberate a Nazi concentration camp. Helene is the abandoned wife of an SS guard who has fled to avoid arrest. Overcome by guilt, she begins to help meet the needs of survivors. Throughout the process, she finds her own liberation - from spiritual bondage, sin, and guilt. Readers will be intrigued and touched by this fascinating story of love, faithfulness, and courage amidst one of the darkest chapters of mankind's history.",
        "cover_url": "http://books.google.com/books/content?id=0Fh5N-i-c7AC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "google_books_id": "eAaiEAAAQBAJ",
        "title": "Lieutenant: Tales from the Super Continent",
        "authors": [
          "Peter Hilditch"
        ],
        "publisher": "Austin Macauley Publishers",
        "isbn_10": "1528989619",
        "isbn_13": "9781528989619",
        "release_date": "2023-01-06",
        "page_count": 266,
        "categories": [
          "Young Adult Fiction"
        ],
        "description": "In the far-flung future, humanity has regressed to an endless warring period. Skill with a forged weapon is king now. Jesse was born on the streets but has always dreamed of becoming a warrior himself. Maybe even a lieutenant? But in this world of endless warfare can anyone take control of the whole continent?",
        "cover_url": "http://books.google.com/books/content?id=eAaiEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": 4.5,
        "format": "book",
        "source": "google_books",
        "series_name": "Lieutenant:",
        "series_position": null
      },
      {
        "google_books_id": "9HBOAgAAQBAJ",
        "title": "Hidden from Men: The Awakened Book Five",
        "authors": [
          "Jason Tesar"
        ],
        "publisher": "4shadow LLC",
        "isbn_10": "1494219581",
        "isbn_13": "9781494219581",
        "release_date": "2013-11-19",
        "page_count": 287,
        "categories": [
          "Fiction"
        ],
        "description": "A powerful adversary is surfacing and Null’s covert battle is on the threshold of open war. Reunited with his father after twenty-two years, Kael must find the balance between protecting him and confronting the enemy who stands between them and their home world. The timelessness of the In-Between has stolen the years that separated Kael and Adair by age, leaving them as distant equals. Having glimpsed Kael’s destiny from the Eternal Realm, Adair struggles to find his role in the life of a son who no longer needs him. Through a global maze of counterintelligence and espionage, a multinational team of operatives has to survive long enough to turn the tide of war. And a father and son will discover how to rebuild what was taken from their lives. In book five of the bestselling Awakened series, Jason Tesar’s epic saga escapes the islands of Scandinavia for the dark forests and rugged mountains of Russia in a tense conflict of subterfuge that blurs the boundaries between sci-fantasy and military fiction.",
        "cover_url": "http://books.google.com/books/content?id=9HBOAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "price": null,
        "format": "book",
        "source": "google_books",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL27838518W",
        "title": "From Blood and Ash",
        "authors": [
          "Jennifer L. Armentrout"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2020-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/14105538-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL22535730W",
        "title": "From Blood and Ash",
        "authors": [
          "Jennifer L. Armentrout",
          "Stina Nielsen"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2020-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/10474893-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL21279423W",
        "title": "From Blood and Ash",
        "authors": [
          "Jennifer L. Armentrout"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2020-01-01",
        "page_count": null,
        "cover_url": "https://covers.openlibrary.org/b/id/10359194-M.jpg",
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL34410341W",
        "title": "From Blood and Ash",
        "authors": [
          "deifoli assil"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2021-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL36724370W",
        "title": "From Blood and Ash",
        "authors": [
          "Jennifer L. Armentrout"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2023-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL42560400W",
        "title": "Blood and Ash Complete Series 4-Book Collection Set by Jennifer L. Armentrout (from Blood and Ash, a Kingdom of Flesh and Fire, the Crown of Gilded Bones, the War of Two Queens)",
        "authors": [
          "Jennifer L. Armentrout"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2022-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      },
      {
        "openlibrary_id": "/works/OL36264168W",
        "title": "Blood and Ash Series 4-Book & Flesh and Fire #2 Collection Set by Jennifer L. Armentrout (from Blood and Ash, a Kingdom of Flesh and Fire, the Crown of Gilded Bones, the War of Two Queens, a Light in the Flame)",
        "authors": [
          "Jennifer L. Armentrout"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "2022-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": "Blood and Ash Series 4-Book & Flesh and Fire",
        "series_position": 2
      },
      {
        "openlibrary_id": "/works/OL43713625W",
        "title": "A preliminary statement of the alkalinity of the blood in infections and the infusion of salts derived from horse's blood-ash as a therapeutic measure",
        "authors": [
          "A. Emil Schmitt"
        ],
        "publisher": null,
        "isbn_10": null,
        "isbn_13": null,
        "release_date": "1902-01-01",
        "page_count": null,
        "cover_url": null,
        "format": null,
        "source": "openlibrary",
        "series_name": null,
        "series_position": null
      }
    ],
    "cached_at": "2025-08-23T11:05:11.449437"
  },
  "isbn_9781952457012": {
    "data": {
      "google_books_id": "SpXZDwAAQBAJ",
      "title": "From Blood and Ash",
      "authors": [
        "Jennifer L. Armentrout"
      ],
      "publisher": "Blue Box Press",
      "isbn_10": "1952457017",
      "isbn_13": "9781952457012",
      "release_date": "2020-03-30",
      "page_count": 345,
      "categories": [
        "Fiction"
      ],
      "description": "Captivating and action-packed, From Blood and Ash is a sexy, addictive, and unexpected fantasy perfect for fans of Sarah J. Maas and Laura Thalassa. A Maiden… Chosen from birth to usher in a new era, Poppy’s life has never been her own. The life of the Maiden is solitary. Never to be touched. Never to be looked upon. Never to be spoken to. Never to experience pleasure. Waiting for the day of her Ascension, she would rather be with the guards, fighting back the evil that took her family, than preparing to be found worthy by the gods. But the choice has never been hers. A Duty… The entire kingdom’s future rests on Poppy’s shoulders, something she’s not even quite sure she wants for herself. Because a Maiden has a heart. And a soul. And longing. And when Hawke, a golden-eyed guard honor bound to ensure her Ascension, enters her life, destiny and duty become tangled with desire and need. He incites her anger, makes her question everything she believes in, and tempts her with the forbidden. A Kingdom… Forsaken by the gods and feared by mortals, a fallen kingdom is rising once more, determined to take back what they believe is theirs through violence and vengeance. And as the shadow of those cursed draws closer, the line between what is forbidden and what is right becomes blurred. Poppy is not only on the verge of losing her heart and being found unworthy by the gods, but also her life when every blood-soaked thread that holds her world together begins to unravel. Reviews for From Blood and Ash: \"Dreamy, twisty, steamy escapism. Take me back!\" -New York Times bestseller Wendy Higgins “Jennifer Armentrout has the power to control my emotions with every word she writes. From swooning to crying to racing through the pages to find out what happens next, I couldn't stop reading about Hawke and Poppy, and you won't be able to either.” - Brigid Kemmerer, New York Times Bestselling Author of A Curse So Dark and Lonely “Action, adventure, sexiness, and angst! From Blood and Ash has it all and double that. So many feels and so many moments it made me cheer for the character. Read. This. Book! You'll be obsessed!” - Tijan NYT bestselling author “From Blood and Ash is a phenomenal fantasy novel that is filled to the brim with danger, mystery and heart melting romance. I loved every single second of it and I couldn’t get enough of this new fantastical world. A heart stopping start to what is clearly going to be a stunning series, perfect for both those who love fantasy and those who are new to the genre. A must read.” Kayleigh, K-Books \"If you think you are ready for From Blood and Ash, think again. Jennifer L. Armentrout has woven a new fantasy universe that will leave you reeling. Filled with action, heart wrenching twists and the most delicious romance, this unputdownable novel comes with a warning: keep a fan close by, because the temperatures are about to rise.\" Elena, The Bibliotheque Blo “In this exciting new novel by Jennifer L. Armentrout, she introduces a fantastical world filled with immense detail, and characters who are poignant and fierce, Jennifer truly has out done herself!” – BookBesties “From Blood and Ash is a fantastic fantasy that will hook you immediately from the very first page! I loved every single moment and all of the characters are ones you will fall in love with! Jennifer L. Armentrout has done it again with her amazing writing skills and lots of detail! Get this book immediately!!!” - Amanda @Stuck In YA Books “Jennifer has stepped into the fantasy genre with this absolutely amazing novel. With characters you will love and more than a few twists and turns, get ready for one amazing adventure.” -Perpetual Fangirl \"This magnificent book has so many pieces in it: fantasy, mystery, forbidden romance, supernatural, lies, deceit, betrayal, love, friendship, family. And so, so, so many secrets your head will be spinning. Jennifer L. Armentrout has created another masterpiece that I will be rushing to buy, and will be telling everyone to read it ASAP!\" ~Jeraca @My Nose in YA Books “From Blood to Ash is the first high fantasy book from Jennifer L Armentrout, but hopefully not the last. Like all her other works, her ability to create worlds, create swoon worthy men, and feisty strong female characters is amazing. Fantasy, mystery, romance, betrayal, love, and steamy scenes, this book has it all.” - Lisa @ The Blonde Book Lover “From Blood & Ash is everything we love about JLA’s fantasy writing...pumped up on steroids. There’s epic world building and plot twists, a strong female lead, a swoon worthy book hottie, a steamy forbidden love story, and side characters that can’t help but steal your heart. My mind was blown by the end of this book.” - Kris S. (frantic4romantic) “Step into an exciting new fantasy world by Jennifer L. Armentrout, From Blood And Ash takes you on a fantastic ride with twists and turns galore. Characters you will love to laugh and cry with. A phenomenal start to an exciting new series.” - Lori Dunn an avid reader “From Blood and Ash was everything I wanted in a high fantasy novel. The myths, the legends, the epic romance, and an adventure that will keep you on your toes beginning to end. I couldn’t put the book down. Truly a brilliant start to what I believe will be yet another amazing series by Jennifer L. Armentrout.\" –Sabrina, Books Are My Life “Jennifer L. Armentrout takes her first step into the high fantasy genre with From Blood and Ash. A story of forbidden love, lies, secrets, and betrayal - it will leave you wanting more after the very last page.” - Love Just Is Books “From Blood and Ash is like reading my favorite book for first time.” - Raquel Herrera “With From Blood and Ash, Jennifer Armentrout successfully takes on the genre of high fantasy, proving, once again, that she is a master of her craft. Filled with epic adventure, forbidden romance, deceit, lies, and betrayal, FB&A draws you in from page one and refuses to let go!” - Erica, The Rest Just Falls Away “Jennifer L. Armentrout comes trough once again with From Blood and Ash as it kept me enthralled throughout the full book. You won't be able to put down this epic story once you start.” - Julalicious Book Paradise “From Blood and Ash strikes the perfect balance between fantasy and romance elements leaving the world feeling live in and full while allowing the relationship between the main characters feeling real and authentic.” - Nads Book Nook, Nadine Bergeron “Be prepared to spend your whole day reading From Blood and Ash. Once you start reading this high fantasy novel, you won't want to put it down.” - Love Book Triangle “From Blood and Ash is absolutely breath taking. JLA does what she does best by creating a fantastical world filled with romance, lies, betrayal, adventure and all things we love and expect from JLA characters that melt our hearts and steal our hearts and souls. I cannot wait for the next one!” - Pia Colon “From Blood and Ash, Jennifer L. Armentrout brought to life a high fantasy that is enthralling. Another masterful addition to my collection. Get ready to stay on your toes from start to end.” - Amy Oh, Reader by the Mountains “From Blood and Ash is the first high fantasy novel by Jennifer L Armentrout and she absolutely nails it. This is fantasy for skeptics and unbelievers because it makes you want to be a fantasy fan! This page turner makes you want to devour it in one night and at the same time savor every detail. Heart stopping and inspiring and grips you from page one.” – Tracy Kirby “An intriguing puzzle of a world, a ruthless hero, a determine heroin, and a plot that will keep you up late, this book is one of the best I've read this year.” – Valerie from Stuck In Books “From Blood and Ash, a thrilling high fantasy that packs a punch, each page will leave you wanting more!” - Tracey, Books & Other Pursuits",
      "cover_url": "http://books.google.com/books/content?id=SpXZDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "price": 8.99,
      "format": "book",
      "source": "google_books",
      "series_name": null,
      "series_position": null
    },
    "cached_at": "2025-08-23T11:05:14.859342"
  }
}